sukhvirrai/EMBT-/pwm_sctimer_pwm_with_dutycyle_change/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PIO018_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO018_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO019_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO019_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO020_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO020_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO021_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO021_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO029_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO029_FUNC_ALT2 0x02u        /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO114_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO114_FUNC_ALT3 0x03u        /*!<@brief Selects pin function.: Alternative connection 3. */
#define PIO115_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO115_FUNC_ALT2 0x02u        /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO11_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO11_FUNC_ALT3 0x03u         /*!<@brief Selects pin function.: Alternative connection 3. */

/*! @name PIO0_18 (number 58), J1[11]/U5[2]/P0_18-FC5_TXD_SCL_MISO
  @{ */
#define BOARD_INITPINS_LEFT_MOTOR_SPEED_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LEFT_MOTOR_SPEED_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_LEFT_MOTOR_SPEED_PIN 18U   /*!<@brief 0U pin index: 18 */
                                                  /* @} */

/*! @name PIO0_19 (number 59), J1[9]/J2[8]/U5[6]/P0_19-FC5_SCK-SPIFI_CSn
  @{ */
#define BOARD_INITPINS_LEFT_MOTOR_DIRECTION_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LEFT_MOTOR_DIRECTION_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_LEFT_MOTOR_DIRECTION_PIN 19U   /*!<@brief 0U pin index: 19 */
                                                      /* @} */

/*! @name PIO0_20 (number 60), J1[13]/U5[5]/P0_20-FC5_RXD_SDA_MOSI
  @{ */
#define BOARD_INITPINS_RIGHT_MOTOR_SPEED_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_RIGHT_MOTOR_SPEED_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_RIGHT_MOTOR_SPEED_PIN 20U   /*!<@brief 0U pin index: 20 */
                                                   /* @} */

/*! @name PIO0_21 (number 61), J2[2]/P0_21-CLKOUT-SPIFI_CLK
  @{ */
#define BOARD_INITPINS_RIGHT_MOTOR_DIRECTION_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_RIGHT_MOTOR_DIRECTION_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_RIGHT_MOTOR_DIRECTION_PIN 21U   /*!<@brief 0U pin index: 21 */
                                                       /* @} */

/*! @name SCT0_OUT7 (number 57), J2[1]/P1_14-SCTO7
  @{ */
/* @} */

/*! @name SCT0_OUT2 (number 11), J2[5]/D2[1]/P0_29-CT32B0_MAT3-RED
  @{ */
/* @} */

/*! @name SCT0_OUT5 (number 62), J1[17]/P1_15-SCTO5-FC7_CTS
  @{ */
/* @} */

/*! @name SCT0_OUT4 (number 15), J1[15]/P1_1-FC5_SSEL2
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
